
    
         L     1,16(,1)          LOAD 4byte value from memory
         ST    13,4(,1)          LOAD 4byte value from memory
LABEL    LR    13,1
         LR    1,2

CHAR     DC    C'ABCD'
NUMBER   DC    A(14)
         ST    13,NUMBER

A        EQU   1

         L  1,CHAR

LEN      EQU   NUMBER-CHAR

&NUM     SETA 1
         LR  1,1
         LR  &NUM,&NUM

&OP      SETC ',1'


.HERE    ANOP      
         LR 1,1



         AIF (&NUM EQ 1).HERE




